// /** @file
//   Strings for RamDiskApp
//;******************************************************************************
//;* Copyright (c) 2015 - 2020, Insyde Software Corp. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************
//; */

#string STR_RAM_DISK_INVALID_INPUT          #language en-US "Invalid input, please type 'RamDiskApp -?'for help\n"
#string STR_RAM_DISK_HELP                   #language en-US "Copyright 2020 Insyde Software Corp. All Rights Reserved.\n"
                                                            "To create or remove a RAM Disk device.\n\n"
                                                            "Usage: \n"
                                                            "  RamDiskApp [-c [[-s size] [-r]]]  [-f fileName]\n"
                                                            "Options:\n"
                                                            "   -c          Create a new RAM Disk.\n"
                                                            "   -s size     Size for created RAM Disk (default=8, min=1, max=512).\n"
                                                            "   -r          To created a removable RAM Disk device\n"
                                                            "   -f FileName Load the file with the speficied FileName.\n"
                                                            "               Then register RAM Disk by EFI_RAM_DISK_PROTOCOL not by H2O RAM Disk protcol \n"
                                                            "               If you are trying to create RAM disk from OS iso file, \n"
                                                            "               Use this parameter for OS iso image. \n"
                                                            "               becasue OS iso image usually is a big file and not FAT16 format.\n"
                                                            "               *NOTICE*: RAM disks created with this parameter will not show on -i command\n"
                                                            "\n"
                                                            "  RamDiskApp [-I] \n"
                                                            "Options:\n"
                                                            "   -i          Display current RAM Disk devices information.\n"
                                                            "\n"
                                                            "  RamDiskApp [-d DiskId] \n"
                                                            "Options:\n"
                                                            "   -d          Remove an existed RAM Disk.\n"
                                                            "\n"
                                                            "  RamDiskApp [-?] \n"
                                                            "Options:\n"
                                                            "   -?          Help document.\n"
                                                            "\n"
                                                            "Examples:\n"
                                                            "  RamDiskApp -c -s 32 -r\n"
                                                            "  RamDiskApp -i\n"
                                                            "  RamDiskApp -f OsImage.iso \n"
                                                            "\n"